OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x001D) __sfr TMR0H;

typedef union
  {
  struct
    {
    unsigned TMR0H0             : 1;
    unsigned TMR0H1             : 1;
    unsigned TMR0H2             : 1;
    unsigned TMR0H3             : 1;
    unsigned TMR0H4             : 1;
    unsigned TMR0H5             : 1;
    unsigned TMR0H6             : 1;
    unsigned TMR0H7             : 1;
    };

  struct
    {
    unsigned T0PR0              : 1;
    unsigned T0PR1              : 1;
    unsigned T0PR2              : 1;
    unsigned T0PR3              : 1;
    unsigned T0PR4              : 1;
    unsigned T0PR5              : 1;
    unsigned T0PR6              : 1;
    unsigned T0PR7              : 1;
    };
  } __TMR0Hbits_t;

extern __at(0x001D) volatile __TMR0Hbits_t TMR0Hbits;

#define _TMR0H_TMR0H0           0x01
#define _TMR0H_T0PR0            0x01
#define _TMR0H_TMR0H1           0x02
#define _TMR0H_T0PR1            0x02
#define _TMR0H_TMR0H2           0x04
#define _TMR0H_T0PR2            0x04
#define _TMR0H_TMR0H3           0x08
#define _TMR0H_T0PR3            0x08
#define _TMR0H_TMR0H4           0x10
#define _TMR0H_T0PR4            0x10
#define _TMR0H_TMR0H5           0x20
#define _TMR0H_T0PR5            0x20
#define _TMR0H_TMR0H6           0x40
#define _TMR0H_T0PR6            0x40
#define _TMR0H_TMR0H7           0x80
#define _TMR0H_T0PR7            0x80

//==============================================================================


//==============================================================================
//        T0CON0 Bits

extern __at(0x001E) __sfr T0CON0;

typedef union
  {
  struct
    {
    unsigned T0OUTPS0           : 1;
    unsigned T0OUTPS1           : 1;
    unsigned T0OUTPS2           : 1;
    unsigned T0OUTPS3           : 1;
    unsigned T016BIT            : 1;
    unsigned T0OUT              : 1;
    unsigned                    : 1;
    unsigned T0EN               : 1;
    };

  struct
    {
    unsigned T0OUTPS            : 4;
    unsigned                    : 4;
    };
  } __T0CON0bits_t;

extern __at(0x001E) volatile __T0CON0bits_t T0CON0bits;

#define _T0OUTPS0               0x01
#define _T0OUTPS1               0x02
#define _T0OUTPS2               0x04
#define _T0OUTPS3               0x08
#define _T016BIT                0x10
#define _T0OUT                  0x20
#define _T0EN                   0x80

//==============================================================================


//==============================================================================
//        T0CON1 Bits

extern __at(0x001F) __sfr T0CON1;

typedef union
  {
  struct
    {
    unsigned T0CKPS0            : 1;
    unsigned T0CKPS1            : 1;
    unsigned T0CKPS2            : 1;
    unsigned T0CKPS3            : 1;
    unsigned T0ASYNC            : 1;
    unsigned T0CS0              : 1;
    unsigned T0CS1              : 1;
    unsigned T0CS2              : 1;
    };

  struct
    {
    unsigned T0PS0              : 1;
    unsigned T0PS1              : 1;
    unsigned T0PS2              : 1;
    unsigned T0PS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T0PS               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T0CKPS             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 5;
    unsigned T0CS               : 3;
    };
  } __T0CON1bits_t;

extern __at(0x001F) volatile __T0CON1bits_t T0CON1bits;

#define _T0CKPS0                0x01
#define _T0PS0                  0x01
#define _T0CKPS1                0x02
#define _T0PS1                  0x02
#define _T0CKPS2                0x04
#define _T0PS2                  0x04
#define _T0CKPS3                0x08
#define _T0PS3                  0x08
#define _T0ASYNC                0x10
#define _T0CS0                  0x20
#define _T0CS1                  0x40
#define _T0CS2                  0x80

//==============================================================================

extern __at(0x008C) __sfr ADRES;
extern __at(0x008C) __sfr ADRESL;
extern __at(0x008D) __sfr ADRESH;
extern __at(0x008E) __sfr ADPREV;

//==============================================================================
//        ADPREVL Bits

extern __at(0x008E) __sfr ADPREVL;

typedef struct
  {
  unsigned ADPREV0              : 1;
  unsigned ADPREV1              : 1;
  unsigned ADPREV2              : 1;
  unsigned ADPREV3              : 1;
  unsigned ADPREV4              : 1;
  unsigned ADPREV5              : 1;
  unsigned ADPREV6              : 1;
  unsigned ADPREV7              : 1;
  } __ADPREVLbits_t;

extern __at(0x008E) volatile __ADPREVLbits_t ADPREVLbits;

#define _ADPREV0                0x01
#define _ADPREV1                0x02
#define _ADPREV2                0x04
#define _ADPREV3                0x08
#define _ADPREV4                0x10
#define _ADPREV5                0x20
#define _ADPREV6                0x40
#define _ADPREV7                0x80

//==============================================================================


//==============================================================================
//        ADPREVH Bits

extern __at(0x008F) __sfr ADPREVH;

typedef struct
  {
  unsigned ADPREV8              : 1;
  unsigned ADPREV9              : 1;
  unsigned ADPREV10             : 1;
  unsigned ADPREV11             : 1;
  unsigned ADPREV12             : 1;
  unsigned ADPREV13             : 1;
  unsigned ADPREV14             : 1;
  unsigned ADPREV15             : 1;
  } __ADPREVHbits_t;

extern __at(0x008F) volatile __ADPREVHbits_t ADPREVHbits;

#define _ADPREV8                0x01
#define _ADPREV9                0x02
#define _ADPREV10               0x04
#define _ADPREV11               0x08
#define _ADPREV12               0x10
#define _ADPREV13               0x20
#define _ADPREV14               0x40
#define _ADPREV15               0x80

//==============================================================================

extern __at(0x0090) __sfr ADACC;

//==============================================================================
//        ADACCL Bits

