OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x0090) __sfr ADACCL;

typedef struct
  {
  unsigned ADACC0               : 1;
  unsigned ADACC1               : 1;
  unsigned ADACC2               : 1;
  unsigned ADACC3               : 1;
  unsigned ADACC4               : 1;
  unsigned ADACC5               : 1;
  unsigned ADACC6               : 1;
  unsigned ADACC7               : 1;
  } __ADACCLbits_t;

extern __at(0x0090) volatile __ADACCLbits_t ADACCLbits;

#define _ADACC0                 0x01
#define _ADACC1                 0x02
#define _ADACC2                 0x04
#define _ADACC3                 0x08
#define _ADACC4                 0x10
#define _ADACC5                 0x20
#define _ADACC6                 0x40
#define _ADACC7                 0x80

//==============================================================================


//==============================================================================
//        ADACCH Bits

extern __at(0x0091) __sfr ADACCH;

typedef struct
  {
  unsigned ADACC8               : 1;
  unsigned ADACC9               : 1;
  unsigned ADACC10              : 1;
  unsigned ADACC11              : 1;
  unsigned ADACC12              : 1;
  unsigned ADACC13              : 1;
  unsigned ADACC14              : 1;
  unsigned ADACC15              : 1;
  } __ADACCHbits_t;

extern __at(0x0091) volatile __ADACCHbits_t ADACCHbits;

#define _ADACC8                 0x01
#define _ADACC9                 0x02
#define _ADACC10                0x04
#define _ADACC11                0x08
#define _ADACC12                0x10
#define _ADACC13                0x20
#define _ADACC14                0x40
#define _ADACC15                0x80

//==============================================================================


//==============================================================================
//        ADCON0 Bits

extern __at(0x0093) __sfr ADCON0;

typedef union
  {
  struct
    {
    unsigned ADGO               : 1;
    unsigned                    : 1;
    unsigned ADFM0              : 1;
    unsigned ADFM1              : 1;
    unsigned ADCS               : 1;
    unsigned                    : 1;
    unsigned ADCONT             : 1;
    unsigned ADON               : 1;
    };

  struct
    {
    unsigned DONE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned NOT_DONE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GO                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned ADFM               : 2;
    unsigned                    : 4;
    };
  } __ADCON0bits_t;

extern __at(0x0093) volatile __ADCON0bits_t ADCON0bits;

#define _ADGO                   0x01
#define _DONE                   0x01
#define _NOT_DONE               0x01
#define _GO                     0x01
#define _GO_NOT_DONE            0x01
#define _ADFM0                  0x04
#define _ADFM1                  0x08
#define _ADCS                   0x10
#define _ADCONT                 0x40
#define _ADON                   0x80

//==============================================================================


//==============================================================================
//        ADCON1 Bits

extern __at(0x0094) __sfr ADCON1;

typedef struct
  {
  unsigned ADDSEN               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ADGPOL               : 1;
  unsigned ADIPEN               : 1;
  unsigned ADPPOL               : 1;
  } __ADCON1bits_t;

extern __at(0x0094) volatile __ADCON1bits_t ADCON1bits;

#define _ADDSEN                 0x01
#define _ADGPOL                 0x20
#define _ADIPEN                 0x40
#define _ADPPOL                 0x80

//==============================================================================


//==============================================================================
//        ADCON2 Bits

extern __at(0x0095) __sfr ADCON2;

typedef union
  {
  struct
    {
    unsigned ADMD0              : 1;
    unsigned ADMD1              : 1;
    unsigned ADMD2              : 1;
    unsigned ADACLR             : 1;
    unsigned ADCRS0             : 1;
    unsigned ADCRS1             : 1;
    unsigned ADCRS2             : 1;
    unsigned ADPSIS             : 1;
    };

  struct
    {
    unsigned ADMD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCRS              : 3;
    unsigned                    : 1;
    };
  } __ADCON2bits_t;

extern __at(0x0095) volatile __ADCON2bits_t ADCON2bits;

#define _ADMD0                  0x01
#define _ADMD1                  0x02
#define _ADMD2                  0x04
#define _ADACLR                 0x08
#define _ADCRS0                 0x10
#define _ADCRS1                 0x20
#define _ADCRS2                 0x40
#define _ADPSIS                 0x80

//==============================================================================


//==============================================================================
//        ADCON3 Bits

extern __at(0x0096) __sfr ADCON3;

typedef union
  {
  struct
    {
    unsigned ADTMD0             : 1;
    unsigned ADTMD1             : 1;
    unsigned ADTMD2             : 1;
    unsigned ADSOI              : 1;
    unsigned ADCALC0            : 1;
    unsigned ADCALC1            : 1;
    unsigned ADCALC2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADTMD              : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCALC             : 3;
    unsigned                    : 1;
    };
  } __ADCON3bits_t;

extern __at(0x0096) volatile __ADCON3bits_t ADCON3bits;

#define _ADTMD0                 0x01
#define _ADTMD1                 0x02
#define _ADTMD2                 0x04
#define _ADSOI                  0x08
#define _ADCALC0                0x10
#define _ADCALC1                0x20
#define _ADCALC2                0x40

//==============================================================================


//==============================================================================
//        ADSTAT Bits

extern __at(0x0097) __sfr ADSTAT;

typedef union
  {
  struct
    {
    unsigned ADSTAT0            : 1;
    unsigned ADSTAT1            : 1;
    unsigned ADSTAT2            : 1;
    unsigned ADMACT             : 1;
    unsigned ADMATH             : 1;
    unsigned ADLTHR             : 1;
    unsigned ADUTHR             : 1;
    unsigned ADAOV              : 1;
    };

  struct
    {
    unsigned ADSTAT             : 3;
    unsigned                    : 5;
    };
  } __ADSTATbits_t;

