OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x0097) volatile __ADSTATbits_t ADSTATbits;

#define _ADSTAT0                0x01
#define _ADSTAT1                0x02
#define _ADSTAT2                0x04
#define _ADMACT                 0x08
#define _ADMATH                 0x10
#define _ADLTHR                 0x20
#define _ADUTHR                 0x40
#define _ADAOV                  0x80

//==============================================================================


//==============================================================================
//        ADCLK Bits

extern __at(0x0098) __sfr ADCLK;

typedef union
  {
  struct
    {
    unsigned ADCCS0             : 1;
    unsigned ADCCS1             : 1;
    unsigned ADCCS2             : 1;
    unsigned ADCCS3             : 1;
    unsigned ADCCS4             : 1;
    unsigned ADCCS5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADCCS              : 6;
    unsigned                    : 2;
    };
  } __ADCLKbits_t;

extern __at(0x0098) volatile __ADCLKbits_t ADCLKbits;

#define _ADCCS0                 0x01
#define _ADCCS1                 0x02
#define _ADCCS2                 0x04
#define _ADCCS3                 0x08
#define _ADCCS4                 0x10
#define _ADCCS5                 0x20

//==============================================================================


//==============================================================================
//        ADACT Bits

extern __at(0x0099) __sfr ADACT;

typedef union
  {
  struct
    {
    unsigned ADACT0             : 1;
    unsigned ADACT1             : 1;
    unsigned ADACT2             : 1;
    unsigned ADACT3             : 1;
    unsigned ADACT4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACT              : 5;
    unsigned                    : 3;
    };
  } __ADACTbits_t;

extern __at(0x0099) volatile __ADACTbits_t ADACTbits;

#define _ADACT0                 0x01
#define _ADACT1                 0x02
#define _ADACT2                 0x04
#define _ADACT3                 0x08
#define _ADACT4                 0x10

//==============================================================================


//==============================================================================
//        ADREF Bits

extern __at(0x009A) __sfr ADREF;

typedef union
  {
  struct
    {
    unsigned ADPREF0            : 1;
    unsigned ADPREF1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADNREF             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPREF             : 2;
    unsigned                    : 6;
    };
  } __ADREFbits_t;

extern __at(0x009A) volatile __ADREFbits_t ADREFbits;

#define _ADPREF0                0x01
#define _ADPREF1                0x02
#define _ADNREF                 0x10

//==============================================================================


//==============================================================================
//        ADCAP Bits

extern __at(0x009B) __sfr ADCAP;

typedef union
  {
  struct
    {
    unsigned ADCAP0             : 1;
    unsigned ADCAP1             : 1;
    unsigned ADCAP2             : 1;
    unsigned ADCAP3             : 1;
    unsigned ADCAP4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADCAP              : 5;
    unsigned                    : 3;
    };
  } __ADCAPbits_t;

extern __at(0x009B) volatile __ADCAPbits_t ADCAPbits;

#define _ADCAP0                 0x01
#define _ADCAP1                 0x02
#define _ADCAP2                 0x04
#define _ADCAP3                 0x08
#define _ADCAP4                 0x10

//==============================================================================


//==============================================================================
//        ADPRE Bits

extern __at(0x009C) __sfr ADPRE;

typedef struct
  {
  unsigned ADPRE0               : 1;
  unsigned ADPRE1               : 1;
  unsigned ADPRE2               : 1;
  unsigned ADPRE3               : 1;
  unsigned ADPRE4               : 1;
  unsigned ADPRE5               : 1;
  unsigned ADPRE6               : 1;
  unsigned ADPRE7               : 1;
  } __ADPREbits_t;

extern __at(0x009C) volatile __ADPREbits_t ADPREbits;

#define _ADPRE0                 0x01
#define _ADPRE1                 0x02
#define _ADPRE2                 0x04
#define _ADPRE3                 0x08
#define _ADPRE4                 0x10
#define _ADPRE5                 0x20
#define _ADPRE6                 0x40
#define _ADPRE7                 0x80

//==============================================================================


//==============================================================================
//        ADACQ Bits

extern __at(0x009D) __sfr ADACQ;

typedef struct
  {
  unsigned ADACQ0               : 1;
  unsigned ADACQ1               : 1;
  unsigned ADACQ2               : 1;
  unsigned ADACQ3               : 1;
  unsigned ADACQ4               : 1;
  unsigned ADACQ5               : 1;
  unsigned ADACQ6               : 1;
  unsigned ADACQ7               : 1;
  } __ADACQbits_t;

extern __at(0x009D) volatile __ADACQbits_t ADACQbits;

#define _ADACQ0                 0x01
#define _ADACQ1                 0x02
#define _ADACQ2                 0x04
#define _ADACQ3                 0x08
#define _ADACQ4                 0x10
#define _ADACQ5                 0x20
#define _ADACQ6                 0x40
#define _ADACQ7                 0x80

//==============================================================================


//==============================================================================
//        ADPCH Bits

extern __at(0x009E) __sfr ADPCH;

typedef union
  {
  struct
    {
    unsigned ADPCH0             : 1;
    unsigned ADPCH1             : 1;
    unsigned ADPCH2             : 1;
    unsigned ADPCH3             : 1;
    unsigned ADPCH4             : 1;
    unsigned ADPCH5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPCH              : 6;
    unsigned                    : 2;
    };
  } __ADPCHbits_t;

