OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x009E) volatile __ADPCHbits_t ADPCHbits;

#define _ADPCH0                 0x01
#define _ADPCH1                 0x02
#define _ADPCH2                 0x04
#define _ADPCH3                 0x08
#define _ADPCH4                 0x10
#define _ADPCH5                 0x20

//==============================================================================


//==============================================================================
//        ADCNT Bits

extern __at(0x010C) __sfr ADCNT;

typedef struct
  {
  unsigned ADCNT0               : 1;
  unsigned ADCNT1               : 1;
  unsigned ADCNT2               : 1;
  unsigned ADCNT3               : 1;
  unsigned ADCNT4               : 1;
  unsigned ADCNT5               : 1;
  unsigned ADCNT6               : 1;
  unsigned ADCNT7               : 1;
  } __ADCNTbits_t;

extern __at(0x010C) volatile __ADCNTbits_t ADCNTbits;

#define _ADCNT0                 0x01
#define _ADCNT1                 0x02
#define _ADCNT2                 0x04
#define _ADCNT3                 0x08
#define _ADCNT4                 0x10
#define _ADCNT5                 0x20
#define _ADCNT6                 0x40
#define _ADCNT7                 0x80

//==============================================================================


//==============================================================================
//        ADRPT Bits

extern __at(0x010D) __sfr ADRPT;

typedef struct
  {
  unsigned ADRPT0               : 1;
  unsigned ADRPT1               : 1;
  unsigned ADRPT2               : 1;
  unsigned ADRPT3               : 1;
  unsigned ADRPT4               : 1;
  unsigned ADRPT5               : 1;
  unsigned ADRPT6               : 1;
  unsigned ADRPT7               : 1;
  } __ADRPTbits_t;

extern __at(0x010D) volatile __ADRPTbits_t ADRPTbits;

#define _ADRPT0                 0x01
#define _ADRPT1                 0x02
#define _ADRPT2                 0x04
#define _ADRPT3                 0x08
#define _ADRPT4                 0x10
#define _ADRPT5                 0x20
#define _ADRPT6                 0x40
#define _ADRPT7                 0x80

//==============================================================================

extern __at(0x010E) __sfr ADLTH;

//==============================================================================
//        ADLTHL Bits

extern __at(0x010E) __sfr ADLTHL;

typedef struct
  {
  unsigned ADLTH0               : 1;
  unsigned ADLTH1               : 1;
  unsigned ADLTH2               : 1;
  unsigned ADLTH3               : 1;
  unsigned ADLTH4               : 1;
  unsigned ADLTH5               : 1;
  unsigned ADLTH6               : 1;
  unsigned ADLTH7               : 1;
  } __ADLTHLbits_t;

extern __at(0x010E) volatile __ADLTHLbits_t ADLTHLbits;

#define _ADLTH0                 0x01
#define _ADLTH1                 0x02
#define _ADLTH2                 0x04
#define _ADLTH3                 0x08
#define _ADLTH4                 0x10
#define _ADLTH5                 0x20
#define _ADLTH6                 0x40
#define _ADLTH7                 0x80

//==============================================================================


//==============================================================================
//        ADLTHH Bits

extern __at(0x010F) __sfr ADLTHH;

typedef struct
  {
  unsigned ADLTH8               : 1;
  unsigned ADLTH9               : 1;
  unsigned ADLTH10              : 1;
  unsigned ADLTH11              : 1;
  unsigned ADLTH12              : 1;
  unsigned ADLTH13              : 1;
  unsigned ADLTH14              : 1;
  unsigned ADLTH15              : 1;
  } __ADLTHHbits_t;

extern __at(0x010F) volatile __ADLTHHbits_t ADLTHHbits;

#define _ADLTH8                 0x01
#define _ADLTH9                 0x02
#define _ADLTH10                0x04
#define _ADLTH11                0x08
#define _ADLTH12                0x10
#define _ADLTH13                0x20
#define _ADLTH14                0x40
#define _ADLTH15                0x80

//==============================================================================

extern __at(0x0110) __sfr ADUTH;

//==============================================================================
//        ADUTHL Bits

extern __at(0x0110) __sfr ADUTHL;

typedef struct
  {
  unsigned ADUTH0               : 1;
  unsigned ADUTH1               : 1;
  unsigned ADUTH2               : 1;
  unsigned ADUTH3               : 1;
  unsigned ADUTH4               : 1;
  unsigned ADUTH5               : 1;
  unsigned ADUTH6               : 1;
  unsigned ADUTH7               : 1;
  } __ADUTHLbits_t;

extern __at(0x0110) volatile __ADUTHLbits_t ADUTHLbits;

#define _ADUTH0                 0x01
#define _ADUTH1                 0x02
#define _ADUTH2                 0x04
#define _ADUTH3                 0x08
#define _ADUTH4                 0x10
#define _ADUTH5                 0x20
#define _ADUTH6                 0x40
#define _ADUTH7                 0x80

//==============================================================================


//==============================================================================
//        ADUTHH Bits

extern __at(0x0111) __sfr ADUTHH;

typedef struct
  {
  unsigned ADUTH8               : 1;
  unsigned ADUTH9               : 1;
  unsigned ADUTH10              : 1;
  unsigned ADUTH11              : 1;
  unsigned ADUTH12              : 1;
  unsigned ADUTH13              : 1;
  unsigned ADUTH14              : 1;
  unsigned ADUTH15              : 1;
  } __ADUTHHbits_t;

extern __at(0x0111) volatile __ADUTHHbits_t ADUTHHbits;

#define _ADUTH8                 0x01
#define _ADUTH9                 0x02
#define _ADUTH10                0x04
#define _ADUTH11                0x08
#define _ADUTH12                0x10
#define _ADUTH13                0x20
#define _ADUTH14                0x40
#define _ADUTH15                0x80

//==============================================================================

extern __at(0x0112) __sfr ADSTPT;

//==============================================================================
//        ADSTPTL Bits

extern __at(0x0112) __sfr ADSTPTL;

typedef struct
  {
  unsigned ADSTPT0              : 1;
  unsigned ADSTPT1              : 1;
  unsigned ADSTPT2              : 1;
  unsigned ADSTPT3              : 1;
  unsigned ADSTPT4              : 1;
  unsigned ADSTPT5              : 1;
  unsigned ADSTPT6              : 1;
  unsigned ADSTPT7              : 1;
  } __ADSTPTLbits_t;

extern __at(0x0112) volatile __ADSTPTLbits_t ADSTPTLbits;

#define _ADSTPT0                0x01
#define _ADSTPT1                0x02
#define _ADSTPT2                0x04
#define _ADSTPT3                0x08
#define _ADSTPT4                0x10
#define _ADSTPT5                0x20
#define _ADSTPT6                0x40
#define _ADSTPT7                0x80

//==============================================================================


//==============================================================================
//        ADSTPTH Bits

