OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x0317) volatile __CCP3CAPbits_t CCP3CAPbits;

#define _CCP3CAP_CTS0           0x01
#define _CCP3CAP_CCP3CTS0       0x01
#define _CCP3CAP_CTS1           0x02
#define _CCP3CAP_CCP3CTS1       0x02
#define _CCP3CAP_CTS2           0x04
#define _CCP3CAP_CCP3CTS2       0x04

//==============================================================================

extern __at(0x0318) __sfr CCPR4;
extern __at(0x0318) __sfr CCPR4L;
extern __at(0x0319) __sfr CCPR4H;

//==============================================================================
//        CCP4CON Bits

extern __at(0x031A) __sfr CCP4CON;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned MODE3              : 1;
    unsigned FMT                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned CCP4MODE0          : 1;
    unsigned CCP4MODE1          : 1;
    unsigned CCP4MODE2          : 1;
    unsigned CCP4MODE3          : 1;
    unsigned CCP4FMT            : 1;
    unsigned CCP4OUT            : 1;
    unsigned CCP4OE             : 1;
    unsigned CCP4EN             : 1;
    };

  struct
    {
    unsigned CCP4MODE           : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned MODE               : 4;
    unsigned                    : 4;
    };
  } __CCP4CONbits_t;

extern __at(0x031A) volatile __CCP4CONbits_t CCP4CONbits;

#define _CCP4CON_MODE0          0x01
#define _CCP4CON_CCP4MODE0      0x01
#define _CCP4CON_MODE1          0x02
#define _CCP4CON_CCP4MODE1      0x02
#define _CCP4CON_MODE2          0x04
#define _CCP4CON_CCP4MODE2      0x04
#define _CCP4CON_MODE3          0x08
#define _CCP4CON_CCP4MODE3      0x08
#define _CCP4CON_FMT            0x10
#define _CCP4CON_CCP4FMT        0x10
#define _CCP4CON_OUT            0x20
#define _CCP4CON_CCP4OUT        0x20
#define _CCP4CON_OE             0x40
#define _CCP4CON_CCP4OE         0x40
#define _CCP4CON_EN             0x80
#define _CCP4CON_CCP4EN         0x80

//==============================================================================


//==============================================================================
//        CCP4CAP Bits

extern __at(0x031B) __sfr CCP4CAP;

typedef union
  {
  struct
    {
    unsigned CTS0               : 1;
    unsigned CTS1               : 1;
    unsigned CTS2               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP4CTS0           : 1;
    unsigned CCP4CTS1           : 1;
    unsigned CCP4CTS2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CTS                : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned CCP4CTS            : 3;
    unsigned                    : 5;
    };
  } __CCP4CAPbits_t;

extern __at(0x031B) volatile __CCP4CAPbits_t CCP4CAPbits;

#define _CCP4CAP_CTS0           0x01
#define _CCP4CAP_CCP4CTS0       0x01
#define _CCP4CAP_CTS1           0x02
#define _CCP4CAP_CCP4CTS1       0x02
#define _CCP4CAP_CTS2           0x04
#define _CCP4CAP_CCP4CTS2       0x04

//==============================================================================

extern __at(0x031C) __sfr CCPR5;
extern __at(0x031C) __sfr CCPR5L;
extern __at(0x031D) __sfr CCPR5H;

//==============================================================================
//        CCP5CON Bits

extern __at(0x031E) __sfr CCP5CON;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned MODE3              : 1;
    unsigned FMT                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned CCP5MODE0          : 1;
    unsigned CCP5MODE1          : 1;
    unsigned CCP5MODE2          : 1;
    unsigned CCP5MODE3          : 1;
    unsigned CCP5FMT            : 1;
    unsigned CCP5OUT            : 1;
    unsigned CCP5OE             : 1;
    unsigned CCP5EN             : 1;
    };

  struct
    {
    unsigned CCP5MODE           : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned MODE               : 4;
    unsigned                    : 4;
    };
  } __CCP5CONbits_t;

extern __at(0x031E) volatile __CCP5CONbits_t CCP5CONbits;

#define _CCP5CON_MODE0          0x01
#define _CCP5CON_CCP5MODE0      0x01
#define _CCP5CON_MODE1          0x02
#define _CCP5CON_CCP5MODE1      0x02
#define _CCP5CON_MODE2          0x04
#define _CCP5CON_CCP5MODE2      0x04
#define _CCP5CON_MODE3          0x08
#define _CCP5CON_CCP5MODE3      0x08
#define _CCP5CON_FMT            0x10
#define _CCP5CON_CCP5FMT        0x10
#define _CCP5CON_OUT            0x20
#define _CCP5CON_CCP5OUT        0x20
#define _CCP5CON_OE             0x40
#define _CCP5CON_CCP5OE         0x40
#define _CCP5CON_EN             0x80
#define _CCP5CON_CCP5EN         0x80

//==============================================================================


//==============================================================================
//        CCP5CAP Bits

extern __at(0x031F) __sfr CCP5CAP;

typedef union
  {
  struct
    {
    unsigned CTS0               : 1;
    unsigned CTS1               : 1;
    unsigned CTS2               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP5CTS0           : 1;
    unsigned CCP5CTS1           : 1;
    unsigned CCP5CTS2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP5CTS            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned CTS                : 3;
    unsigned                    : 5;
    };
  } __CCP5CAPbits_t;

extern __at(0x031F) volatile __CCP5CAPbits_t CCP5CAPbits;

