OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x0390) volatile __PWM7DCLbits_t PWM7DCLbits;

#define _PWM7DCL_DC0            0x40
#define _PWM7DCL_PWM7DC0        0x40
#define _PWM7DCL_PWMPW0         0x40
#define _PWM7DCL_DC1            0x80
#define _PWM7DCL_PWM7DC1        0x80
#define _PWM7DCL_PWMPW1         0x80

//==============================================================================


//==============================================================================
//        PWM7DCH Bits

extern __at(0x0391) __sfr PWM7DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM7DC2            : 1;
    unsigned PWM7DC3            : 1;
    unsigned PWM7DC4            : 1;
    unsigned PWM7DC5            : 1;
    unsigned PWM7DC6            : 1;
    unsigned PWM7DC7            : 1;
    unsigned PWM7DC8            : 1;
    unsigned PWM7DC9            : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM7DCHbits_t;

extern __at(0x0391) volatile __PWM7DCHbits_t PWM7DCHbits;

#define _PWM7DCH_DC2            0x01
#define _PWM7DCH_PWM7DC2        0x01
#define _PWM7DCH_PWMPW2         0x01
#define _PWM7DCH_DC3            0x02
#define _PWM7DCH_PWM7DC3        0x02
#define _PWM7DCH_PWMPW3         0x02
#define _PWM7DCH_DC4            0x04
#define _PWM7DCH_PWM7DC4        0x04
#define _PWM7DCH_PWMPW4         0x04
#define _PWM7DCH_DC5            0x08
#define _PWM7DCH_PWM7DC5        0x08
#define _PWM7DCH_PWMPW5         0x08
#define _PWM7DCH_DC6            0x10
#define _PWM7DCH_PWM7DC6        0x10
#define _PWM7DCH_PWMPW6         0x10
#define _PWM7DCH_DC7            0x20
#define _PWM7DCH_PWM7DC7        0x20
#define _PWM7DCH_PWMPW7         0x20
#define _PWM7DCH_DC8            0x40
#define _PWM7DCH_PWM7DC8        0x40
#define _PWM7DCH_PWMPW8         0x40
#define _PWM7DCH_DC9            0x80
#define _PWM7DCH_PWM7DC9        0x80
#define _PWM7DCH_PWMPW9         0x80

//==============================================================================


//==============================================================================
//        PWM7CON Bits

extern __at(0x0392) __sfr PWM7CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM7POL            : 1;
    unsigned PWM7OUT            : 1;
    unsigned PWM7OE             : 1;
    unsigned PWM7EN             : 1;
    };
  } __PWM7CONbits_t;

extern __at(0x0392) volatile __PWM7CONbits_t PWM7CONbits;

#define _PWM7CON_POL            0x10
#define _PWM7CON_PWM7POL        0x10
#define _PWM7CON_OUT            0x20
#define _PWM7CON_PWM7OUT        0x20
#define _PWM7CON_OE             0x40
#define _PWM7CON_PWM7OE         0x40
#define _PWM7CON_EN             0x80
#define _PWM7CON_PWM7EN         0x80

//==============================================================================


//==============================================================================
//        SCANLADRL Bits

extern __at(0x040C) __sfr SCANLADRL;

typedef union
  {
  struct
    {
    unsigned LADR0              : 1;
    unsigned LADR1              : 1;
    unsigned LADR2              : 1;
    unsigned LADR3              : 1;
    unsigned LADR4              : 1;
    unsigned LADR5              : 1;
    unsigned LADR6              : 1;
    unsigned LADR7              : 1;
    };

  struct
    {
    unsigned SCANLADR0          : 1;
    unsigned SCANLADR1          : 1;
    unsigned SCANLADR2          : 1;
    unsigned SCANLADR3          : 1;
    unsigned SCANLADR4          : 1;
    unsigned SCANLADR5          : 1;
    unsigned SCANLADR6          : 1;
    unsigned SCANLADR7          : 1;
    };
  } __SCANLADRLbits_t;

extern __at(0x040C) volatile __SCANLADRLbits_t SCANLADRLbits;

#define _LADR0                  0x01
#define _SCANLADR0              0x01
#define _LADR1                  0x02
#define _SCANLADR1              0x02
#define _LADR2                  0x04
#define _SCANLADR2              0x04
#define _LADR3                  0x08
#define _SCANLADR3              0x08
#define _LADR4                  0x10
#define _SCANLADR4              0x10
#define _LADR5                  0x20
#define _SCANLADR5              0x20
#define _LADR6                  0x40
#define _SCANLADR6              0x40
#define _LADR7                  0x80
#define _SCANLADR7              0x80

//==============================================================================


//==============================================================================
//        SCANLADRH Bits

extern __at(0x040D) __sfr SCANLADRH;

typedef union
  {
  struct
    {
    unsigned LADR8              : 1;
    unsigned LADR9              : 1;
    unsigned LADR10             : 1;
    unsigned LADR11             : 1;
    unsigned LADR12             : 1;
    unsigned LADR13             : 1;
    unsigned LADR14             : 1;
    unsigned LADR15             : 1;
    };

  struct
    {
    unsigned SCANLADR8          : 1;
    unsigned SCANLADR9          : 1;
    unsigned SCANLADR10         : 1;
    unsigned SCANLADR11         : 1;
    unsigned SCANLADR12         : 1;
    unsigned SCANLADR13         : 1;
    unsigned SCANLADR14         : 1;
    unsigned SCANLADR15         : 1;
    };
  } __SCANLADRHbits_t;

