OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
#define _TSEL0                  0x01
#define _SCANTSEL0              0x01
#define _TSEL1                  0x02
#define _SCANTSEL1              0x02
#define _TSEL2                  0x04
#define _SCANTSEL2              0x04
#define _TSEL3                  0x08
#define _SCANTSEL3              0x08

//==============================================================================

extern __at(0x0416) __sfr CRCDATA;

//==============================================================================
//        CRCDATL Bits

extern __at(0x0416) __sfr CRCDATL;

typedef struct
  {
  unsigned DATA0                : 1;
  unsigned DATA1                : 1;
  unsigned DATA2                : 1;
  unsigned DATA3                : 1;
  unsigned DATA4                : 1;
  unsigned DATA5                : 1;
  unsigned DATA6                : 1;
  unsigned DATA7                : 1;
  } __CRCDATLbits_t;

extern __at(0x0416) volatile __CRCDATLbits_t CRCDATLbits;

#define _DATA0                  0x01
#define _DATA1                  0x02
#define _DATA2                  0x04
#define _DATA3                  0x08
#define _DATA4                  0x10
#define _DATA5                  0x20
#define _DATA6                  0x40
#define _DATA7                  0x80

//==============================================================================


//==============================================================================
//        CRCDATH Bits

extern __at(0x0417) __sfr CRCDATH;

typedef struct
  {
  unsigned DATA8                : 1;
  unsigned DATA9                : 1;
  unsigned DATA10               : 1;
  unsigned DATA11               : 1;
  unsigned DATA12               : 1;
  unsigned DATA13               : 1;
  unsigned DATA14               : 1;
  unsigned DATA15               : 1;
  } __CRCDATHbits_t;

extern __at(0x0417) volatile __CRCDATHbits_t CRCDATHbits;

#define _DATA8                  0x01
#define _DATA9                  0x02
#define _DATA10                 0x04
#define _DATA11                 0x08
#define _DATA12                 0x10
#define _DATA13                 0x20
#define _DATA14                 0x40
#define _DATA15                 0x80

//==============================================================================

extern __at(0x0418) __sfr CRCACC;

//==============================================================================
//        CRCACCL Bits

extern __at(0x0418) __sfr CRCACCL;

typedef struct
  {
  unsigned ACC0                 : 1;
  unsigned ACC1                 : 1;
  unsigned ACC2                 : 1;
  unsigned ACC3                 : 1;
  unsigned ACC4                 : 1;
  unsigned ACC5                 : 1;
  unsigned ACC6                 : 1;
  unsigned ACC7                 : 1;
  } __CRCACCLbits_t;

extern __at(0x0418) volatile __CRCACCLbits_t CRCACCLbits;

#define _ACC0                   0x01
#define _ACC1                   0x02
#define _ACC2                   0x04
#define _ACC3                   0x08
#define _ACC4                   0x10
#define _ACC5                   0x20
#define _ACC6                   0x40
#define _ACC7                   0x80

//==============================================================================


//==============================================================================
//        CRCACCH Bits

extern __at(0x0419) __sfr CRCACCH;

typedef struct
  {
  unsigned ACC8                 : 1;
  unsigned ACC9                 : 1;
  unsigned ACC10                : 1;
  unsigned ACC11                : 1;
  unsigned ACC12                : 1;
  unsigned ACC13                : 1;
  unsigned ACC14                : 1;
  unsigned ACC15                : 1;
  } __CRCACCHbits_t;

extern __at(0x0419) volatile __CRCACCHbits_t CRCACCHbits;

#define _ACC8                   0x01
#define _ACC9                   0x02
#define _ACC10                  0x04
#define _ACC11                  0x08
#define _ACC12                  0x10
#define _ACC13                  0x20
#define _ACC14                  0x40
#define _ACC15                  0x80

//==============================================================================

extern __at(0x041A) __sfr CRCSHFT;

//==============================================================================
//        CRCSHIFTL Bits

extern __at(0x041A) __sfr CRCSHIFTL;

typedef struct
  {
  unsigned SHFT0                : 1;
  unsigned SHFT1                : 1;
  unsigned SHFT2                : 1;
  unsigned SHFT3                : 1;
  unsigned SHFT4                : 1;
  unsigned SHFT5                : 1;
  unsigned SHFT6                : 1;
  unsigned SHFT7                : 1;
  } __CRCSHIFTLbits_t;

extern __at(0x041A) volatile __CRCSHIFTLbits_t CRCSHIFTLbits;

#define _SHFT0                  0x01
#define _SHFT1                  0x02
#define _SHFT2                  0x04
#define _SHFT3                  0x08
#define _SHFT4                  0x10
#define _SHFT5                  0x20
#define _SHFT6                  0x40
#define _SHFT7                  0x80

//==============================================================================


//==============================================================================
//        CRCSHIFTH Bits

extern __at(0x041B) __sfr CRCSHIFTH;

typedef struct
  {
  unsigned SHFT8                : 1;
  unsigned SHFT9                : 1;
  unsigned SHFT10               : 1;
  unsigned SHFT11               : 1;
  unsigned SHFT12               : 1;
  unsigned SHFT13               : 1;
  unsigned SHFT14               : 1;
  unsigned SHFT15               : 1;
  } __CRCSHIFTHbits_t;

extern __at(0x041B) volatile __CRCSHIFTHbits_t CRCSHIFTHbits;

#define _SHFT8                  0x01
#define _SHFT9                  0x02
#define _SHFT10                 0x04
#define _SHFT11                 0x08
#define _SHFT12                 0x10
#define _SHFT13                 0x20
#define _SHFT14                 0x40
#define _SHFT15                 0x80

//==============================================================================

extern __at(0x041C) __sfr CRCXOR;

//==============================================================================
//        CRCXORL Bits

extern __at(0x041C) __sfr CRCXORL;

typedef struct
  {
  unsigned                      : 1;
  unsigned X1                   : 1;
  unsigned X2                   : 1;
  unsigned X3                   : 1;
  unsigned X4                   : 1;
  unsigned X5                   : 1;
  unsigned X6                   : 1;
  unsigned X7                   : 1;
  } __CRCXORLbits_t;

