OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
extern __at(0x070C) volatile __PIR0bits_t PIR0bits;

#define _INTF                   0x01
#define _IOCIF                  0x10
#define _TMR0IF                 0x20

//==============================================================================


//==============================================================================
//        PIR1 Bits

extern __at(0x070D) __sfr PIR1;

typedef struct
  {
  unsigned ADIF                 : 1;
  unsigned ADTIF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CSWIF                : 1;
  unsigned OSFIF                : 1;
  } __PIR1bits_t;

extern __at(0x070D) volatile __PIR1bits_t PIR1bits;

#define _ADIF                   0x01
#define _ADTIF                  0x02
#define _CSWIF                  0x40
#define _OSFIF                  0x80

//==============================================================================


//==============================================================================
//        PIR2 Bits

extern __at(0x070E) __sfr PIR2;

typedef struct
  {
  unsigned C1IF                 : 1;
  unsigned C2IF                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ZCDIF                : 1;
  unsigned                      : 1;
  } __PIR2bits_t;

extern __at(0x070E) volatile __PIR2bits_t PIR2bits;

#define _C1IF                   0x01
#define _C2IF                   0x02
#define _ZCDIF                  0x40

//==============================================================================


//==============================================================================
//        PIR3 Bits

extern __at(0x070F) __sfr PIR3;

typedef struct
  {
  unsigned SSP1IF               : 1;
  unsigned BCL1IF               : 1;
  unsigned SSP2IF               : 1;
  unsigned BCL2IF               : 1;
  unsigned TXIF                 : 1;
  unsigned RCIF                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIR3bits_t;

extern __at(0x070F) volatile __PIR3bits_t PIR3bits;

#define _SSP1IF                 0x01
#define _BCL1IF                 0x02
#define _SSP2IF                 0x04
#define _BCL2IF                 0x08
#define _TXIF                   0x10
#define _RCIF                   0x20

//==============================================================================


//==============================================================================
//        PIR4 Bits

extern __at(0x0710) __sfr PIR4;

typedef struct
  {
  unsigned TMR1IF               : 1;
  unsigned TMR2IF               : 1;
  unsigned TMR3IF               : 1;
  unsigned TMR4IF               : 1;
  unsigned TMR5IF               : 1;
  unsigned TMR6IF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIR4bits_t;

extern __at(0x0710) volatile __PIR4bits_t PIR4bits;

#define _TMR1IF                 0x01
#define _TMR2IF                 0x02
#define _TMR3IF                 0x04
#define _TMR4IF                 0x08
#define _TMR5IF                 0x10
#define _TMR6IF                 0x20

//==============================================================================


//==============================================================================
//        PIR5 Bits

extern __at(0x0711) __sfr PIR5;

typedef struct
  {
  unsigned TMR1GIF              : 1;
  unsigned TMR3GIF              : 1;
  unsigned TMR5GIF              : 1;
  unsigned                      : 1;
  unsigned CLC1IF               : 1;
  unsigned CLC2IF               : 1;
  unsigned CLC3IF               : 1;
  unsigned CLC4IF               : 1;
  } __PIR5bits_t;

extern __at(0x0711) volatile __PIR5bits_t PIR5bits;

#define _TMR1GIF                0x01
#define _TMR3GIF                0x02
#define _TMR5GIF                0x04
#define _CLC1IF                 0x10
#define _CLC2IF                 0x20
#define _CLC3IF                 0x40
#define _CLC4IF                 0x80

//==============================================================================


//==============================================================================
//        PIR6 Bits

extern __at(0x0712) __sfr PIR6;

typedef struct
  {
  unsigned CCP1IF               : 1;
  unsigned CCP2IF               : 1;
  unsigned CCP3IF               : 1;
  unsigned CCP4IF               : 1;
  unsigned CCP5IF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIR6bits_t;

extern __at(0x0712) volatile __PIR6bits_t PIR6bits;

#define _CCP1IF                 0x01
#define _CCP2IF                 0x02
#define _CCP3IF                 0x04
#define _CCP4IF                 0x08
#define _CCP5IF                 0x10

//==============================================================================


//==============================================================================
//        PIR7 Bits

extern __at(0x0713) __sfr PIR7;

typedef union
  {
  struct
    {
    unsigned CWG1IF             : 1;
    unsigned CWG2IF             : 1;
    unsigned CWG3IF             : 1;
    unsigned                    : 1;
    unsigned NCO1IF             : 1;
    unsigned NVMIF              : 1;
    unsigned CRCIF              : 1;
    unsigned SCANIF             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NCOIF              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PIR7bits_t;

extern __at(0x0713) volatile __PIR7bits_t PIR7bits;

#define _CWG1IF                 0x01
#define _CWG2IF                 0x02
#define _CWG3IF                 0x04
#define _NCO1IF                 0x10
#define _NCOIF                  0x10
#define _NVMIF                  0x20
#define _CRCIF                  0x40
#define _SCANIF                 0x80

//==============================================================================


//==============================================================================
//        PIR8 Bits

extern __at(0x0714) __sfr PIR8;

typedef struct
  {
  unsigned SMT1IF               : 1;
  unsigned SMT1PRAIF            : 1;
  unsigned SMT1PWAIF            : 1;
  unsigned SMT2IF               : 1;
  unsigned SMT2PRAIF            : 1;
  unsigned SMT2PWAIF            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIR8bits_t;

