OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
#define _DAC1CON0_NSS           0x01
#define _DAC1CON0_DAC1NSS       0x01
#define _DAC1CON0_DAC1PSS0      0x04
#define _DAC1CON0_PSS0          0x04
#define _DAC1CON0_DAC1PSS1      0x08
#define _DAC1CON0_PSS1          0x08
#define _DAC1CON0_OE2           0x10
#define _DAC1CON0_DAC1OE2       0x10
#define _DAC1CON0_OE1           0x20
#define _DAC1CON0_DAC1OE1       0x20
#define _DAC1CON0_EN            0x80
#define _DAC1CON0_DAC1EN        0x80

//==============================================================================


//==============================================================================
//        DAC1CON1 Bits

extern __at(0x090F) __sfr DAC1CON1;

typedef union
  {
  struct
    {
    unsigned DAC1R0             : 1;
    unsigned DAC1R1             : 1;
    unsigned DAC1R2             : 1;
    unsigned DAC1R3             : 1;
    unsigned DAC1R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC1R              : 5;
    unsigned                    : 3;
    };
  } __DAC1CON1bits_t;

extern __at(0x090F) volatile __DAC1CON1bits_t DAC1CON1bits;

#define _DAC1R0                 0x01
#define _DAC1R1                 0x02
#define _DAC1R2                 0x04
#define _DAC1R3                 0x08
#define _DAC1R4                 0x10

//==============================================================================


//==============================================================================
//        ZCD1CON Bits

extern __at(0x091F) __sfr ZCD1CON;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned ZCD1INTN           : 1;
    unsigned ZCD1INTP           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ZCD1POL            : 1;
    unsigned ZCD1OUT            : 1;
    unsigned                    : 1;
    unsigned ZCD1EN             : 1;
    };

  struct
    {
    unsigned ZCDINTN            : 1;
    unsigned ZCDINTP            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ZCDPOL             : 1;
    unsigned ZCDOUT             : 1;
    unsigned                    : 1;
    unsigned ZCDEN              : 1;
    };
  } __ZCD1CONbits_t;

extern __at(0x091F) volatile __ZCD1CONbits_t ZCD1CONbits;

#define _ZCD1CON_INTN           0x01
#define _ZCD1CON_ZCD1INTN       0x01
#define _ZCD1CON_ZCDINTN        0x01
#define _ZCD1CON_INTP           0x02
#define _ZCD1CON_ZCD1INTP       0x02
#define _ZCD1CON_ZCDINTP        0x02
#define _ZCD1CON_POL            0x10
#define _ZCD1CON_ZCD1POL        0x10
#define _ZCD1CON_ZCDPOL         0x10
#define _ZCD1CON_OUT            0x20
#define _ZCD1CON_ZCD1OUT        0x20
#define _ZCD1CON_ZCDOUT         0x20
#define _ZCD1CON_EN             0x80
#define _ZCD1CON_ZCD1EN         0x80
#define _ZCD1CON_ZCDEN          0x80

//==============================================================================


//==============================================================================
//        ZCDCON Bits

extern __at(0x091F) __sfr ZCDCON;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned ZCD1INTN           : 1;
    unsigned ZCD1INTP           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ZCD1POL            : 1;
    unsigned ZCD1OUT            : 1;
    unsigned                    : 1;
    unsigned ZCD1EN             : 1;
    };

  struct
    {
    unsigned ZCDINTN            : 1;
    unsigned ZCDINTP            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ZCDPOL             : 1;
    unsigned ZCDOUT             : 1;
    unsigned                    : 1;
    unsigned ZCDEN              : 1;
    };
  } __ZCDCONbits_t;

extern __at(0x091F) volatile __ZCDCONbits_t ZCDCONbits;

#define _ZCDCON_INTN            0x01
#define _ZCDCON_ZCD1INTN        0x01
#define _ZCDCON_ZCDINTN         0x01
#define _ZCDCON_INTP            0x02
#define _ZCDCON_ZCD1INTP        0x02
#define _ZCDCON_ZCDINTP         0x02
#define _ZCDCON_POL             0x10
#define _ZCDCON_ZCD1POL         0x10
#define _ZCDCON_ZCDPOL          0x10
#define _ZCDCON_OUT             0x20
#define _ZCDCON_ZCD1OUT         0x20
#define _ZCDCON_ZCDOUT          0x20
#define _ZCDCON_EN              0x80
#define _ZCDCON_ZCD1EN          0x80
#define _ZCDCON_ZCDEN           0x80

//==============================================================================


//==============================================================================
//        CMOUT Bits

extern __at(0x098F) __sfr CMOUT;

typedef union
  {
  struct
    {
    unsigned MC1OUT             : 1;
    unsigned MC2OUT             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C1OUT              : 1;
    unsigned C2OUT              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CMOUTbits_t;

extern __at(0x098F) volatile __CMOUTbits_t CMOUTbits;

#define _CMOUT_MC1OUT           0x01
#define _CMOUT_C1OUT            0x01
#define _CMOUT_MC2OUT           0x02
#define _CMOUT_C2OUT            0x02

//==============================================================================


//==============================================================================
//        CMSTAT Bits

extern __at(0x098F) __sfr CMSTAT;

typedef union
  {
  struct
    {
    unsigned MC1OUT             : 1;
    unsigned MC2OUT             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C1OUT              : 1;
    unsigned C2OUT              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CMSTATbits_t;

