OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
//----------------------------- CONFIG3 Options -------------------------------

#define _WDTCPS_WDTCPS_0        0x3FE0  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_1        0x3FE1  // Divider ratio 1:64.
#define _WDTCPS_WDTCPS_2        0x3FE2  // Divider ratio 1:128.
#define _WDTCPS_WDTCPS_3        0x3FE3  // Divider ratio 1:256.
#define _WDTCPS_WDTCPS_4        0x3FE4  // Divider ratio 1:512.
#define _WDTCPS_WDTCPS_5        0x3FE5  // Divider ratio 1:1024.
#define _WDTCPS_WDTCPS_6        0x3FE6  // Divider ratio 1:2048.
#define _WDTCPS_WDTCPS_7        0x3FE7  // Divider ratio 1:4096.
#define _WDTCPS_WDTCPS_8        0x3FE8  // Divider ratio 1:8192.
#define _WDTCPS_WDTCPS_9        0x3FE9  // Divider ratio 1:16384.
#define _WDTCPS_WDTCPS_10       0x3FEA  // Divider ratio 1:32768.
#define _WDTCPS_WDTCPS_11       0x3FEB  // Divider ratio 1:65536.
#define _WDTCPS_WDTCPS_12       0x3FEC  // Divider ratio 1:131072.
#define _WDTCPS_WDTCPS_13       0x3FED  // Divider ratio 1:262144.
#define _WDTCPS_WDTCPS_14       0x3FEE  // Divider ratio 1:524299.
#define _WDTCPS_WDTCPS_15       0x3FEF  // Divider ratio 1:1048576.
#define _WDTCPS_WDTCPS_16       0x3FF0  // Divider ratio 1:2097152.
#define _WDTCPS_WDTCPS_17       0x3FF1  // Divider ratio 1:4194304.
#define _WDTCPS_WDTCPS_18       0x3FF2  // Divider ratio 1:8388608.
#define _WDTCPS_WDTCPS_19       0x3FF3  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_20       0x3FF4  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_21       0x3FF5  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_22       0x3FF6  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_23       0x3FF7  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_24       0x3FF8  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_25       0x3FF9  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_26       0x3FFA  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_27       0x3FFB  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_28       0x3FFC  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_29       0x3FFD  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_30       0x3FFE  // Divider ratio 1:32.
#define _WDTCPS_WDTCPS_31       0x3FFF  // Divider ratio 1:65536; software control of WDTPS.
#define _WDTE_OFF               0x3F9F  // WDT Disabled, SWDTEN is ignored.
#define _WDTE_SWDTEN            0x3FBF  // WDT enabled/disabled by SWDTEN bit in WDTCON0.
#define _WDTE_NSLEEP            0x3FDF  // WDT enabled while sleep=0, suspended when sleep=1; SWDTEN ignored.
#define _WDTE_ON                0x3FFF  // WDT enabled regardless of sleep; SWDTEN ignored.
#define _WDTCWS_WDTCWS_0        0x38FF  // window delay = 87.5 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_1        0x39FF  // window delay = 75 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_2        0x3AFF  // window delay = 62.5 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_3        0x3BFF  // window delay = 50 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_4        0x3CFF  // window delay = 37.5 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_5        0x3DFF  // window delay = 25 percent of time; no software control; keyed access required.
#define _WDTCWS_WDTCWS_6        0x3EFF  // window always open (100%); no software control; keyed access required.
#define _WDTCWS_WDTCWS_7        0x3FFF  // window always open (100%); software control; keyed access not required.
#define _WDTCCS_LFINTOSC        0x07FF  // WDT reference clock is the 31.0kHz LFINTOSC output.
#define _WDTCCS_HFINTOSC        0x0FFF  // WDT reference clock is the 31.25 kHz HFINTOSC.
#define _WDTCCS_SC              0x3FFF  // Software Control.

//----------------------------- CONFIG4 Options -------------------------------

#define _WRT_ON                 0x3FFC  // 0x0000 to 0x1FFF write protected.
#define _WRT_WRT_lower          0x3FFD  // 0x0000 to x0FFF write protected.
#define _WRT_WRT_upper          0x3FFE  // 0x0000 to 0x01FF write protected.
#define _WRT_OFF                0x3FFF  // Write protection off.
#define _SCANE_not_available    0x2FFF  // Scanner module is not available for use.
#define _SCANE_available        0x3FFF  // Scanner module is available for use.
#define _LVP_OFF                0x1FFF  // High Voltage on MCLR/Vpp must be used for programming.
#define _LVP_ON                 0x3FFF  // Low Voltage programming enabled. MCLR/Vpp pin function is MCLR.

//----------------------------- CONFIG5 Options -------------------------------

#define _CP_ON                  0x3FFE  // UserNVM code protection enabled.
#define _CP_OFF                 0x3FFF  // UserNVM code protection disabled.
#define _CPD_ON                 0x3FFD  // DataNVM code protection enabled.
#define _CPD_OFF                0x3FFF  // DataNVM code protection disabled.

//==============================================================================

#define _DEVID1                 0x8006

#define _IDLOC0                 0x8000
#define _IDLOC1                 0x8001
#define _IDLOC2                 0x8002
#define _IDLOC3                 0x8003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADACC8                  ADACCHbits.ADACC8               // bit 0
#define ADACC9                  ADACCHbits.ADACC9               // bit 1
#define ADACC10                 ADACCHbits.ADACC10              // bit 2
#define ADACC11                 ADACCHbits.ADACC11              // bit 3
#define ADACC12                 ADACCHbits.ADACC12              // bit 4
#define ADACC13                 ADACCHbits.ADACC13              // bit 5
#define ADACC14                 ADACCHbits.ADACC14              // bit 6
#define ADACC15                 ADACCHbits.ADACC15              // bit 7

#define ADACC0                  ADACCLbits.ADACC0               // bit 0
#define ADACC1                  ADACCLbits.ADACC1               // bit 1
#define ADACC2                  ADACCLbits.ADACC2               // bit 2
#define ADACC3                  ADACCLbits.ADACC3               // bit 3
#define ADACC4                  ADACCLbits.ADACC4               // bit 4
#define ADACC5                  ADACCLbits.ADACC5               // bit 5
#define ADACC6                  ADACCLbits.ADACC6               // bit 6
#define ADACC7                  ADACCLbits.ADACC7               // bit 7

#define ADACQ0                  ADACQbits.ADACQ0                // bit 0
#define ADACQ1                  ADACQbits.ADACQ1                // bit 1
#define ADACQ2                  ADACQbits.ADACQ2                // bit 2
#define ADACQ3                  ADACQbits.ADACQ3                // bit 3
#define ADACQ4                  ADACQbits.ADACQ4                // bit 4
#define ADACQ5                  ADACQbits.ADACQ5                // bit 5
#define ADACQ6                  ADACQbits.ADACQ6                // bit 6
#define ADACQ7                  ADACQbits.ADACQ7                // bit 7

#define ADACT0                  ADACTbits.ADACT0                // bit 0
#define ADACT1                  ADACTbits.ADACT1                // bit 1
#define ADACT2                  ADACTbits.ADACT2                // bit 2
#define ADACT3                  ADACTbits.ADACT3                // bit 3
#define ADACT4                  ADACTbits.ADACT4                // bit 4

#define ADCACTPPS0              ADCACTPPSbits.ADCACTPPS0        // bit 0
#define ADCACTPPS1              ADCACTPPSbits.ADCACTPPS1        // bit 1
#define ADCACTPPS2              ADCACTPPSbits.ADCACTPPS2        // bit 2
#define ADCACTPPS3              ADCACTPPSbits.ADCACTPPS3        // bit 3
#define ADCACTPPS4              ADCACTPPSbits.ADCACTPPS4        // bit 4

#define ADCAP0                  ADCAPbits.ADCAP0                // bit 0
#define ADCAP1                  ADCAPbits.ADCAP1                // bit 1
#define ADCAP2                  ADCAPbits.ADCAP2                // bit 2
#define ADCAP3                  ADCAPbits.ADCAP3                // bit 3
#define ADCAP4                  ADCAPbits.ADCAP4                // bit 4

#define ADCCS0                  ADCLKbits.ADCCS0                // bit 0
#define ADCCS1                  ADCLKbits.ADCCS1                // bit 1
#define ADCCS2                  ADCLKbits.ADCCS2                // bit 2
#define ADCCS3                  ADCLKbits.ADCCS3                // bit 3
#define ADCCS4                  ADCLKbits.ADCCS4                // bit 4
#define ADCCS5                  ADCLKbits.ADCCS5                // bit 5

#define ADCNT0                  ADCNTbits.ADCNT0                // bit 0
#define ADCNT1                  ADCNTbits.ADCNT1                // bit 1
#define ADCNT2                  ADCNTbits.ADCNT2                // bit 2
#define ADCNT3                  ADCNTbits.ADCNT3                // bit 3
#define ADCNT4                  ADCNTbits.ADCNT4                // bit 4
#define ADCNT5                  ADCNTbits.ADCNT5                // bit 5
#define ADCNT6                  ADCNTbits.ADCNT6                // bit 6
#define ADCNT7                  ADCNTbits.ADCNT7                // bit 7

