OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18855.h
#define DSMMD                   PMD5bits.DSMMD                  // bit 0
#define CLC1MD                  PMD5bits.CLC1MD                 // bit 1
#define CLC2MD                  PMD5bits.CLC2MD                 // bit 2
#define CLC3MD                  PMD5bits.CLC3MD                 // bit 3
#define CLC4MD                  PMD5bits.CLC4MD                 // bit 4
#define SMT1MD                  PMD5bits.SMT1MD                 // bit 6
#define SMT2MD                  PMD5bits.SMT2MD                 // bit 7

#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5
#define RA6                     PORTAbits.RA6                   // bit 6
#define RA7                     PORTAbits.RA7                   // bit 7

#define RB0                     PORTBbits.RB0                   // bit 0
#define RB1                     PORTBbits.RB1                   // bit 1
#define RB2                     PORTBbits.RB2                   // bit 2
#define RB3                     PORTBbits.RB3                   // bit 3
#define RB4                     PORTBbits.RB4                   // bit 4
#define RB5                     PORTBbits.RB5                   // bit 5
#define RB6                     PORTBbits.RB6                   // bit 6
#define RB7                     PORTBbits.RB7                   // bit 7

#define RC0                     PORTCbits.RC0                   // bit 0
#define RC1                     PORTCbits.RC1                   // bit 1
#define RC2                     PORTCbits.RC2                   // bit 2
#define RC3                     PORTCbits.RC3                   // bit 3
#define RC4                     PORTCbits.RC4                   // bit 4
#define RC5                     PORTCbits.RC5                   // bit 5
#define RC6                     PORTCbits.RC6                   // bit 6
#define RC7                     PORTCbits.RC7                   // bit 7

#define RE3                     PORTEbits.RE3                   // bit 3

#define PPSLOCKED               PPSLOCKbits.PPSLOCKED           // bit 0

#define TMR0H0                  PR0bits.TMR0H0                  // bit 0, shadows bit in PR0bits
#define T0PR0                   PR0bits.T0PR0                   // bit 0, shadows bit in PR0bits
#define TMR0H1                  PR0bits.TMR0H1                  // bit 1, shadows bit in PR0bits
#define T0PR1                   PR0bits.T0PR1                   // bit 1, shadows bit in PR0bits
#define TMR0H2                  PR0bits.TMR0H2                  // bit 2, shadows bit in PR0bits
#define T0PR2                   PR0bits.T0PR2                   // bit 2, shadows bit in PR0bits
#define TMR0H3                  PR0bits.TMR0H3                  // bit 3, shadows bit in PR0bits
#define T0PR3                   PR0bits.T0PR3                   // bit 3, shadows bit in PR0bits
#define TMR0H4                  PR0bits.TMR0H4                  // bit 4, shadows bit in PR0bits
#define T0PR4                   PR0bits.T0PR4                   // bit 4, shadows bit in PR0bits
#define TMR0H5                  PR0bits.TMR0H5                  // bit 5, shadows bit in PR0bits
#define T0PR5                   PR0bits.T0PR5                   // bit 5, shadows bit in PR0bits
#define TMR0H6                  PR0bits.TMR0H6                  // bit 6, shadows bit in PR0bits
#define T0PR6                   PR0bits.T0PR6                   // bit 6, shadows bit in PR0bits
#define TMR0H7                  PR0bits.TMR0H7                  // bit 7, shadows bit in PR0bits
#define T0PR7                   PR0bits.T0PR7                   // bit 7, shadows bit in PR0bits

#define GVAL                    PR1bits.GVAL                    // bit 2, shadows bit in PR1bits
#define T1GVAL                  PR1bits.T1GVAL                  // bit 2, shadows bit in PR1bits
#define GGO_NOT_DONE            PR1bits.GGO_NOT_DONE            // bit 3, shadows bit in PR1bits
#define T1GGO_NOT_DONE          PR1bits.T1GGO_NOT_DONE          // bit 3, shadows bit in PR1bits
#define T1GGO                   PR1bits.T1GGO                   // bit 3, shadows bit in PR1bits
#define GSPM                    PR1bits.GSPM                    // bit 4, shadows bit in PR1bits
#define T1GSPM                  PR1bits.T1GSPM                  // bit 4, shadows bit in PR1bits
#define GTM                     PR1bits.GTM                     // bit 5, shadows bit in PR1bits
#define T1GTM                   PR1bits.T1GTM                   // bit 5, shadows bit in PR1bits
#define GPOL                    PR1bits.GPOL                    // bit 6, shadows bit in PR1bits
#define T1GPOL                  PR1bits.T1GPOL                  // bit 6, shadows bit in PR1bits
#define GE                      PR1bits.GE                      // bit 7, shadows bit in PR1bits
#define T1GE                    PR1bits.T1GE                    // bit 7, shadows bit in PR1bits

#define DC2                     PWM6DCHbits.DC2                 // bit 0, shadows bit in PWM6DCHbits
#define PWM6DC2                 PWM6DCHbits.PWM6DC2             // bit 0, shadows bit in PWM6DCHbits
#define PWMPW2                  PWM6DCHbits.PWMPW2              // bit 0, shadows bit in PWM6DCHbits
#define DC3                     PWM6DCHbits.DC3                 // bit 1, shadows bit in PWM6DCHbits
#define PWM6DC3                 PWM6DCHbits.PWM6DC3             // bit 1, shadows bit in PWM6DCHbits
#define PWMPW3                  PWM6DCHbits.PWMPW3              // bit 1, shadows bit in PWM6DCHbits
#define DC4                     PWM6DCHbits.DC4                 // bit 2, shadows bit in PWM6DCHbits
#define PWM6DC4                 PWM6DCHbits.PWM6DC4             // bit 2, shadows bit in PWM6DCHbits
#define PWMPW4                  PWM6DCHbits.PWMPW4              // bit 2, shadows bit in PWM6DCHbits
#define DC5                     PWM6DCHbits.DC5                 // bit 3, shadows bit in PWM6DCHbits
#define PWM6DC5                 PWM6DCHbits.PWM6DC5             // bit 3, shadows bit in PWM6DCHbits
#define PWMPW5                  PWM6DCHbits.PWMPW5              // bit 3, shadows bit in PWM6DCHbits
#define DC6                     PWM6DCHbits.DC6                 // bit 4, shadows bit in PWM6DCHbits
#define PWM6DC6                 PWM6DCHbits.PWM6DC6             // bit 4, shadows bit in PWM6DCHbits
#define PWMPW6                  PWM6DCHbits.PWMPW6              // bit 4, shadows bit in PWM6DCHbits
#define DC7                     PWM6DCHbits.DC7                 // bit 5, shadows bit in PWM6DCHbits
#define PWM6DC7                 PWM6DCHbits.PWM6DC7             // bit 5, shadows bit in PWM6DCHbits
#define PWMPW7                  PWM6DCHbits.PWMPW7              // bit 5, shadows bit in PWM6DCHbits
#define DC8                     PWM6DCHbits.DC8                 // bit 6, shadows bit in PWM6DCHbits
#define PWM6DC8                 PWM6DCHbits.PWM6DC8             // bit 6, shadows bit in PWM6DCHbits
#define PWMPW8                  PWM6DCHbits.PWMPW8              // bit 6, shadows bit in PWM6DCHbits
#define DC9                     PWM6DCHbits.DC9                 // bit 7, shadows bit in PWM6DCHbits
#define PWM6DC9                 PWM6DCHbits.PWM6DC9             // bit 7, shadows bit in PWM6DCHbits
#define PWMPW9                  PWM6DCHbits.PWMPW9              // bit 7, shadows bit in PWM6DCHbits

